<?php

// 验证规则;调用方法：\csn\Safe::is + 键名首字母大写
return [
    // 键名
    'key' => '/^[\w|\-]+$/i',
    // 邮箱
    'email' => '/^[a-zA-Z0-9][\w\.\-]+@[a-zA-Z0-9]{1,10}\.[a-zA-Z]+(\.[a-zA-Z]+)?$/i',
    // 座机号
    'phone' => '/^(\d{3,4})?\d{7,8}$/',
    // 手机号
    'tel' => '/^1[34578]{1}\d{9}$/',
    // 微信号
    'wx' => '/^[\-\w]{6,20}$/',
    // QQ号
    'QQ' => '/^[1-9]\d{4,11}$/',
    // 验证码
    'code' => '/^[0-9a-zA-Z]{4,6}$/',
    // 用户名
    'usr' => '/^[\x80-\xff|\w]{3,20}$/',
    // 密码
    'pwd' => '/^[\w\-]{6,20}$/',
    // 网址
    'url' => '/^https?:\/\/.+/i'
];