<?php

namespace csn;

class Api extends Instance
{

    // ----------------------------------------------------------------------
    //  状态表：状态=>码
    // ----------------------------------------------------------------------

    private $status = ['y' => 0, 'n' => 1, 'a' => 2, 'e' => 3];

    // ----------------------------------------------------------------------
    //  状态码
    // ----------------------------------------------------------------------

    private $code;

    // ----------------------------------------------------------------------
    //  消息
    // ----------------------------------------------------------------------

    private $msg;

    // ----------------------------------------------------------------------
    //  构造函数
    // ----------------------------------------------------------------------

    function construct($msg = null, $status = 'y')
    {
        $this->msg = $msg;
        key_exists($status, $this->status) || Csn::end('Api 不支持状态类型：' . $status);
        $this->code = $this->status[$status];
        return false;
    }

    // ----------------------------------------------------------------------
    //  设置额外数据
    // ----------------------------------------------------------------------

    private $data;

    function data($data, $name = null)
    {
        $this->data = is_null($name) ? ['data'=>$data] : [$name => $data];
        return $this;
    }

    // ----------------------------------------------------------------------
    //  接口返回
    // ----------------------------------------------------------------------

    function run($data = null, $name = null)
    {
        is_null($data) || $this->data($data, $name);
        header('Content-Type:application/json');
        $data = is_null($this->data) ? [] : $this->data;
        $data['status'] = $this->code;
        is_null($this->msg) || $data['msg'] = $this->msg;
        exit(json_encode($data));
    }

}